frontend/controllers/ActionController.php

SELECT * FROM `comments` WHERE `id`='26'
SELECT * FROM `user` WHERE `id`=18
---
    public function actionGetComment()
    {
        Yii::$app->response->format = Response::FORMAT_JSON;
        $req = Yii::$app->request;

        if ($req->isAjax) {
            $comment = Comments::find()->where(["id" => $req->post("id")])->one();
            $user = User::find()->where(['id' => $comment["id_user"]])->one();

SELECT * FROM `projects` WHERE `is_master`=1
---
    public function actionGetProjects()
    {
        $req = Yii::$app->request;
        Yii::$app->response->format = Response::FORMAT_JSON;

        if ($req->isAjax) {
            $id = Yii::$app->user->identity->id;
            $projects = Projects::find()->where(['is_master' => 1])->all();

SELECT * FROM `projects` WHERE `name`='Fruits'
---

            if (in_array($data, $valid)) {

                $project = Projects::find()->where(['name' => $data])->one();

SELECT * FROM `lists` WHERE `id`='99'
---
                $allList = [];

                foreach ($id_list as $value) {
                    $list = Lists::find()->where(["id" => $value])->one();