frontend/controllers/ActionController.php

    public function actionCheckCard()
    {
        Yii::$app->response->format = Response::FORMAT_JSON;
        $req = Yii::$app->request;

        if ($req->isAjax) {
            $card = Cards::find()->where(['id' => $req->post('id')])->one();
            $name = $card->title;

            if ($card->is_done == 1) {
                $card->is_done = 0;
                $output = "Topik <strong>" . $name . " </strong> Telah Batal Diceklis";
            } else {
                $card->is_done = 1;
                $output = "Topik <strong>" . $name . " </strong> Telah Diceklis";
            }
            $card->save();
---
SELECT * FROM `cards` WHERE `id`='21'
UPDATE `cards` SET `is_done`=1 WHERE `id`=21

    public function actionGetComment()
    {
        Yii::$app->response->format = Response::FORMAT_JSON;
        $req = Yii::$app->request;

        if ($req->isAjax) {
            $comment = Comments::find()->where(["id" => $req->post("id")])->one();
            $user = User::find()->where(['id' => $comment["id_user"]])->one();
---
SELECT * FROM `comments` WHERE `id`='25'
SELECT * FROM `user` WHERE `id`=15

    public function actionEditCardDescription()
    {
        $req = Yii::$app->request;

        if ($req->isAjax) {
            Yii::$app->response->format = Response::FORMAT_JSON;

            $card = Cards::find()->where(["id" => $req->post("id")])->one();
            $card->description = $req->post("data");
            $card->save();

            $updated_card = Cards::find()->where(["id" => $req->post("id")])->one();
---
SELECT * FROM `cards` WHERE `id`='37'

    public function actionGetCardData()
    {
        Yii::$app->response->format = Response::FORMAT_JSON;
        $req = Yii::$app->request;

        if ($req->isAjax) {
            $card = Cards::find()->where(["id" => $req->post("id")])->one();
---
SELECT * FROM `cards` WHERE `id`='21'

    public function actionGetCards()
    {
        Yii::$app->response->format = Response::FORMAT_JSON;
        $req = Yii::$app->request;

        if ($req->isAjax) {
            $cards = Cards::find()->where(["id" => $req->post("id")])->one();
---
SELECT * FROM `cards` WHERE `id`='23'

    public function actionGetProjects()
    {
        $req = Yii::$app->request;
        Yii::$app->response->format = Response::FORMAT_JSON;

        if ($req->isAjax) {
            $id = Yii::$app->user->identity->id;
            $name = [];

            $valid = User::find()->where(['id' => $id])->one();
            if ($valid->role == 1) {
                $projects = Projects::find()->all();
                foreach ($projects as $key) {
                    array_push($name, $key->name);
                }
                return [
                    'projects' => $name
                ];
            }

            $projects = Projects::find()->where(['is_master' => 1])->all();
---
SELECT * FROM `projects` WHERE `id`='2'
SELECT * FROM `projects` WHERE `is_master`=1

            }

            foreach ($relations as $key) {
                $projects = Projects::find()->where(['id' => $key])->one();
---
SELECT * FROM `projects` WHERE `id`='2'

    public function actionGetLists()
    {
        Yii::$app->response->format = Response::FORMAT_JSON;
        $req = Yii::$app->request;
        $id = Yii::$app->user->identity->id;

        if ($req->isAjax) {

            $valid = User::find()->where(['id' => $id])->one();

            if ($req->post("data") != "") {
                $data = $req->post("data");
            } else {
                $data = Yii::$app->session->get('project');
            }


            if ($valid->role == 1) {

                $project = Projects::find()->where(['name' => $data])->one();
                $id_list = explode("|", $project->id_list);
                array_pop($id_list);

                $allList = [];

                foreach ($id_list as $value) {
                    $list = Lists::find()->where(["id" => $value])->one();
---
SELECT * FROM `user` WHERE `id`=18
SELECT * FROM `projects` WHERE `name`='Drinks'
SELECT * FROM `lists` WHERE `id`='64'

                ];
            }

            $projects = Projects::find()->where(['is_master' => 1])->all();
---
SELECT * FROM `projects` WHERE `is_master`=1

                    $relation = explode("|", $value->relation);
                    array_pop($relation);
                    foreach ($relation as $value) {
                        $relate = Projects::find()->where(['id' => $value])->one();
---
SELECT * FROM `projects` WHERE `id`='2'


            if (in_array($data, $valid)) {

                $project = Projects::find()->where(['name' => $data])->one();
---
SELECT * FROM `projects` WHERE `name`='Drinks'

                $allList = [];

                foreach ($id_list as $value) {
                    $list = Lists::find()->where(["id" => $value])->one();
---
SELECT * FROM `lists` WHERE `id`='64'